Revit 2027 API
PlasticvinylType Enumeration
 The enumerated type representing the permitted values for the asset property "PlasticvinylType" from the "PlasticVinyl" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum PlasticvinylType
Public Enumeration PlasticvinylType
public enum class PlasticvinylType
type PlasticvinylType
Members
Member name | Value | Description
Plasticsolid | 0
Plastictransparent | 1
Vinyl | 2
See Also
Reference
Autodesk.Revit.DB.Visual Namespace